<?php
echo "1. 要件定義(要求仕様書)"."<br>";
echo "要求仕様書とは、エンドユーザーが開発担当側に対して開発を依頼するシステム要件を文章化したもの。一方で、要件定義の段階で、エンドユーザーではなくて、SEがまとめることもある。 また、システムによっては、要求仕様書の作成は行わずに、要件定義の段階で、要求仕様も含めて要件定義書として一つにすることもある。";
echo '<br>';
echo '<br>';
echo "2. 単体テスト・結合テスト"."<br>";
echo "”単体テスト”とは機能単位でプログラムが正しく動作するか検証するテスト。
「Unit Test（ユニット・テスト）」の頭文字を取って”UT”とも呼ばれる。
”結合テスト”とは機能を組み合わせて正しく動作するのか検証するテスト。
「Integration Test（インテグレーション・テスト）」の頭文字を取って”IT”とも呼ばれる。
";
echo '<br>';
echo '<br>';
echo "3. テスト仕様書(どのようなもの、項目)"."<br>";
echo "テスト仕様書とは、システムやソフトウェアが、クライアントのヒアリングをもとに作り上げた要件定義書の通りに機能するかどうか、テストするポイントをまとめたドキュメント。
具体的には、結合テストや総合テストの工程でどの機能を、どのテスト技法を使ってテストするのか記されている。
";
echo '<br>';
echo '<br>';
?>
