<?php
function getVolume($base, $height, $depth) {
    $area = $base * $height * $depth;
    print "直方体の体積は".$area."です。";
}
getVolume(5,10,8);
?>


<?php
echo '<br>'.'<br>';
echo "1. ハッシュ化"."<br>";
echo "元のデータから一定の計算手順に従ってハッシュ値と呼ばれる規則性のない固定長の値を求め、その値によって元のデータを置き換えること。 パスワードの保管などでよく用いられる手法である。"."<br>";
echo "2. 総合テスト"."<br>";
echo "システムテストは総合テストとも呼ばれ、ソフトウェアおよびシステムの検証手法の１つです。 構築したシステムが全体で予定通りの機能を満たしているか、また機能や性能が仕様書通りに構築できているかを検証すること。"."<br>";
echo "3. デバッグ"."<br>";
echo "コンピュータプログラムや電気機器中のバグ・欠陥を発見および修正し、動作を仕様通りのものとするための作業である。"."<br>";
echo '<br>';
?>

